Revit 2024 API
AdvancedGlazing.GlazingTransmissionRoughness Property
 The property labeled "Transmissive roughness" from the "AdvancedGlazing" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public static string GlazingTransmissionRoughness { get; }
Visual Basic
Public Shared ReadOnly Property GlazingTransmissionRoughness As String
	Get
Visual C++
public:
static property String^ GlazingTransmissionRoughness {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble". This property allows a connected asset.
See Also
AdvancedGlazing Class
Autodesk.Revit.DB.Visual Namespace